package object;

public class Object {
//객체 지향 프로그래밍
	
/*
	객체란 : 
	프로그래밍에서 속성(멤버변수)과 기능(메서드)을 가지는 프로그램 단위이다.

	객체(인간세계) 
		자전거 = 속성 : 바퀴,체인
				기능 : 이동수단
		TV = 속성 : 채널,사운드
				기능 : 미디어방출
	
	객체(프로그램)
		날씨프로그램 = 속성 : 온도,미세먼지
		 			기능 : 날씨예보
		 사칙연산프로그램 = 속성 : / * - + 			
						기능 : 연산기능
 
 	클래스란 :
 	객체를 생성하기 위한 툴로 모든 객체는 클래스로부터 생성된다.
 	
 	프로그래머는 
 	클래스(정해진 툴)로 부터 
 	속성(멤버변수)과 기능(메서드)로 하여금 객체를 생성하여  
 	사용자의 입맛에 맏게 커스터마이징을 하는 것 

	***
 	붕어빵틀(클래스)로 
 	팥이나 슈크림(속성:멤버변수) 을 넣어
 	찍어낸후(기능:메서드) 
 	붕어빵(객체) 을 만든다
 	
 	클래스의 구성요소 
 	
 	클래스는속성(멤버변수)와 기능(메서드)로 구성된다 
 	자전거
 	속성(멤버변수) : 안장,핸들,기어,바구니
 	기능(메서드) : 기어변속,가속,브레이크,이동수단 
 
 */
	public void ob() {
		
	}
}
